/**
 *
 * 类（Class）
 * 类是TypeScript的核心，使用TypeScript开发时，大部分代码都是写在类里面的。
 * 这里主要介绍类的定义，构造函数，以及类的继承
 *
 *
 */
/**
 * 接口（interface）
 * 用来建立某种代码约定，使得其他开发者在调用某个方法或
 * 创建新的类时必须遵循接口所定义的代码约定
 */
/**
 *
 * 模块（Modual）
 * 模块可以帮助开发者将代码分割为可重用的单元。
 * 开发者可以自己决定将那些资源（类，方法，变量）暴露出去供外部使用，
 * 哪些资源只能在模块内部使用
 *
 */
/**
 *
 * 注解（annotation）
 * 注解为程序的元素（类、方法、变量）加上更加直观更加明了的说明，
 * 这些说明信息与程序的业务逻辑无关，而是供指定的工具或框架使用的。
 *
 */
/**
 *
 * 类型定义文件（*.d.ts）
 *
 * 类型定义文件用来帮助开发者在TypeScript中使用已有的javascript的工具包
 * 例如：Jquery
 *
 *
 */ 
//# sourceMappingURL=demoApp.js.map